README.org
** General Keybindings
A keybinding framework to set keybindings easily.
The Leader key is what you will press when you want to access your keybindings (SPC + . Find file).
To search and replace, use query-replace-regexp to replace one by one C-M-% (SPC to replace n to skip).

#+begin_src emacs-lisp
(defun dnsc/dired-open-to-side ()
  "Opens dired at the current directory in a window to the side"
  (interactive)
  (split-window-horizontally)
  (windmove-right)
  (dired-jump))

(defun dnsc/open-agenda-only-window ()
  "Opens agenda in full-screen (only-window)"
  (interactive)
  (let (current-value org-agenda-window-setup)
		(unwind-protect
				(progn
					(setq org-agenda-window-setup 'only-window)
					(org-agenda nil "p"))
			(setq org-agenda-window-setup current-value))))

(use-package general
	:ensure t
	:demand t
  :config
  (general-evil-setup)
  ;; Set up 'SPC' as the leader key
  (general-create-definer start/leader-keys
		:states '(normal insert visual motion emacs)
		:keymaps 'override
		:prefix "SPC"           ;; Set leader key
		:global-prefix "C-SPC") ;; Set global leader key

  (start/leader-keys
		"." '(find-file :wk "Find file"))

  (start/leader-keys
		"SPC" '(project-find-file :wk "[f]ind a file in the project"))

  (start/leader-keys
		"TAB" '(activities-switch  :wk "Switch activity"))

  (start/leader-keys
		"-" '(dired-jump :wk "open dired at current directory"))

  (start/leader-keys
		"a" '(:ignore t :wk "[a]ctivities")
    "a n" '(activities-new :wk "[n]ew activity")
    "a c" '(activities-define :wk "[c]reate activity from current tab layout")
    "a r" '(activities-resume :wk "[r]esume activity")
    "a l" '(activities-list :wk "[l]ist activities")
    "a s" '(activities-suspend :wk "[s]uspend activity")
    "a b" '(activities-switch-buffer :wk "switch activity [b]uffer")
    "a R" '(activities-revert :wk "[R]evert activity to default state")
    "a d" '(activities-kill :wk "[d]elete activity"))

  (start/leader-keys
		"f" '(:ignore t :wk "[f]ind")
		"f c" '((lambda () (interactive) (find-file "~/.emacs.d/README.org")) :wk "Edit emacs [c]onfig")
		"f s" '(save-buffer :wk "Saves current buffer")
		"f r" '(consult-recent-file :wk "Find [r]ecent files")
		"f f" '(consult-fd :wk "Find [f]iles")
		"f h" '(consult-org-heading :wk "Find [h]eadline")
		"f y" '(consult-yank-from-kill-ring :wk "[y]ank from kill ring")
		"f g" '(consult-ripgrep :wk "Find with rip[g]rep")
		"f l" '(consult-goto-line :wk "Find [l]ine")
		"f i" '(consult-imenu :wk "Find [i]menu buffer locations"))

  (start/leader-keys
		"b" '(:ignore t :wk "[b]uffers")
		"b b" '(consult-buffer :wk "switch to [b]uffer")
		"b d" '(kill-current-buffer :wk "[d]elete this buffer")
		"b n" '(next-buffer :wk "[n]ext buffer")
		"b p" '(previous-buffer :wk "[p]revious buffer")
		"b r" '(revert-buffer :wk "[r]eload buffer"))

  (start/leader-keys
		"w" '(:ignore t :wk "[w]indow")
		"w s" '(split-window-vertically :wk "[s]plit window horizontally")
		"w v" '(split-window-horizontally :wk "Split window [v]ertically")
		"w d" '(delete-window :wk "[d]elete window")
		"w z" '(delete-other-windows :wk "[z]oom to window")
		"w x" '(kill-buffer-and-window :wk "E[x]terminate buffer and window")
		"w h" '(windmove-left :wk "Move to left window")
		"w k" '(windmove-up :wk "Move to upper window")
		"w j" '(windmove-down :wk "Move to lower window")
		"w l" '(windmove-right :wk "Move to right window"))

  (start/leader-keys
		"n" '(:ignore t :wk "[n]otes")
		"n n" '(denote :wk "[n]ew denote")
		"n b" '(denote-backlinks :wk "show [b]acklinks for current denote")
		"n r" '(denote-rename-file :wk "[r]ename current denote")
		"n i" '(denote-link-or-create :wk "[i]nsert link to existing denote or create new")
		"n f" '(consult-denote-find :wk "[f]ind denote")
		"n s" '(consult-denote-grep :wk "[s]earch in denotes")
		"n l" '(denote-menu-list-notes :wk "[l]ist denotes"))

  (start/leader-keys
		"j" '(:ignore t :wk "popups")
		"j j" '(popper-toggle :wk "Open popup")
		"j c" '(popper-cycle :wk "Cycle popups")
		"j t" '(popper-toggle-type :wk "Convert current buffer to popup buffer"))

  (start/leader-keys
		"d" '(:ignore t :wk "AI")
		"d s" '(gptel-send :wk "Send to gptel")
		"d c" '(gptel-send :wk "Open gptel chat")
		"d m" '(gptel-menu :wk "Open gptel menu"))

  (start/leader-keys
		"o" '(:ignore t :wk "[o]rg/[o]pen")
		"o d" '(dired :wk "Open [d]ired")
		"o l" '(org-agenda :wk "Open al[l] agenda views")
		"o a" '((lambda () (interactive) (org-agenda nil "p")) :wk "Open personal [a]genda")
		"o w a" '((lambda () (interactive) (org-agenda nil "w")) :wk "Open work [a]genda")
		"o w f" '(dnsc/open-agenda-only-window :wk "Open personal [a]genda")
		"o w n" '((lambda () (interactive) (find-file "~/orgnzr/work.org")) :wk "Open work [n]ote")
		"o m t" '(org-todo :wk "Change todo state")
		"o m c" '(org-toggle-checkbox :wk "Toggle [c]heckbox")
		"o c" '(org-capture :wk "[o]rg-[c]apture a new task"))

  (start/leader-keys
		"g" '(:ignore t :wk "[g]it & more")
		"g b" '(magit-branch-checkout :wk "Switch [b]ranch")
		"g c" '(:ignore t :wk "[c]reate")
		"g c b" '(magit-branch-and-checkout :wk "[b]ranch and checkout")
		"g c c" '(magit-commit-create :wk "[c]ommit")
		"g f" '(:ignore t :wk "[f]ind")
		"g f c" '(magit-show-commit :wk "[c]ommit")
		"g f l" '(magit-log :wk "[l]og")
		"g f f" '(magit-find-file :wk "[f]ile")
		"g F" '(magit-fetch :wk "[F]etch")
		"g l" '(git-link :wk "Navigate to git forge [l]ink")
		"g t" '(git-timemachine :wk "Navigate to git forge [l]ink")
		"g s" '(magit-stash :wk "[s]tash")
		"g g" '(magit-status :wk "Ma[g]it status"))

  (start/leader-keys
		"h" '(:ignore t :wk "[h]elp")
		"h s" '(describe-symbol :wk "Get help for [s]ymbol")
		"h k" '(describe-key :wk "Get help for [s]ymbol")
		"h v" '(describe-variable :wk "Get help for [v]ariable")
		"h f" '(describe-function :wk "Get help for [f]unction")
		"h r r" '((lambda () (interactive) (load-file user-init-file)) :wk "Reload Emacs config"))

  (start/leader-keys
		"p" '(:ignore t :wk "[p]rojects")
		"p p" '(project-switch-project :wk "switch [p]rojects")
		"p b" '(consult-project-buffer :wk "switch [b]uffers within project")
		"p g" '(consult-ripgrep :wk "[s]earch within project")
		"p s" '(project-shell :wk "Opeommitn [s]hell within project")
		"p d" '(project-dired :wk "Open [d]ired in project root")
		"p c" '(project-compile :wk "[c]ompile project")
		"p k" '(project-kill-buffers :wk "[d]elete all project buffers")
		"p r" '(project-query-replace-regexp :wk "[r]eplace in current project")
		"p x" '(project-async-shell-command :wk "e[x]ecute shell command"))
  
  (start/leader-keys
		"s" '(:ignore t :wk "[s]earch/[s]pell")
		"s c" '(jinx-correct :wk "[c]orrect spelling")
		"s l" '(jinx-languages :wk "Jinx [l]anguages"))

  (start/leader-keys
		"t" '(:ignore t :wk "[t]abs")
		"t d" '(tab-close :wk "[d]elete tab")
		"t n" '(tab-next :wk "[n]ext tab")
		"t p" '(tab-previous :wk "[p]revious tab")
		"t t" '(tab-switch :wk "[s]witch tabs"))

  (start/leader-keys
		"q" '(:ignore t :wk "[q]uit")
		"q q" '(kill-emacs :wk "[q][q]uit Emacs and Daemon")))
(elpaca-wait)
#+end_src

** Which-Key
I am still learning all the keybindings that Emacs provides (including the ones I have set).

#+begin_src emacs-lisp
(use-package which-key
  :diminish
  :init
  (which-key-mode 1)
  :custom
  (which-key-side-window-location 'bottom)
  (which-key-sort-order #'which-key-key-order-alpha) ;; Same as default, except single characters are sorted alphabetically
  (which-key-sort-uppercase-first nil)
  (which-key-add-column-padding 4) ;; Number of spaces to add to the left of each column
  (which-key-min-display-lines 6)  ;; Increase the minimum lines to display, because the default is only 1
  (which-key-idle-delay 0.5)       ;; Set the time delay (in seconds) for the which-key popup to appear
  (which-key-max-description-length 35)
  (which-key-allow-imprecise-window-fit nil)) 
#+end_src

* Workspaces, Projects & Buffer Management
