README.org
** Activities
This package: https://github.com/alphapapa/activities.el might be very interesting. It provides a solution for both workspace & session management.

#+begin_src emacs-lisp
(use-package activities
  :ensure t
  :custom
  (setq edebug-inhibit-emacs-lisp-mode-bindings t)
  :init
  (activities-mode)
  (activities-tabs-mode))
#+end_src

** Project Management
Using ~project.el~ as it does enough of what I need. Might extend it in the future based on my requirements.

#+begin_src emacs-lisp
(use-package project
  :ensure nil
  :custom
  (project-vc-extra-root-markers '(".project" "go.mod" "package.json" "deps.edn" "bb.edn")))
#+end_src

** Pop-Up Buffers
~popper.el~ allows for sane management of buffers that are not central to the editing itself, like ~Messages~, ~Output~, ~Compilation~ and more. I configured the popup buffers to show with ~SPC j j~, a keybinding that is very quick to type from the home row.

#+begin_src emacs-lisp
(use-package popper
  :ensure t
  :init
  (setq popper-group-function #'popper-group-by-directory)
  (setq popper-reference-buffers
        '("\\*Messages\\*"
          "Output\\*$"
          "\\*Async Shell Command\\*"
          help-mode
          compilation-mode))
  (popper-mode +1)
  (popper-echo-mode +1))
#+end_src

* Appearance
** Theme
Coming from Neovim and TUI-based tools in general I mainly used widely available color themes on all platforms (e.g. ~catppuccin~ or ~rose-pine~). After trying it out for a few minutes the built-in modus-themes won me over, though. The exceptional support of Emacs' faces as well as the ergonomic overrides and options for [[https://protesilaos.com/emacs/modus-themes#h:f4651d55-8c07-46aa-b52b-bed1e53463bb][advanced customization]] is just that good.

#+begin_src emacs-lisp
(use-package modus-themes
	:ensure t
  :config

  (custom-set-faces
   '(tab-bar ((t (:height 0.85))))
   '(activities-tabs
     ((t (:slant italic :foreground "#c6daff" :background "#0d0e1c"))))
   '(tab-bar-tab-inactive
     ((t (:slant italic :foreground "#c6daff" :background "#0d0e1c")))))
  
  (setq modus-themes-common-palette-overrides
		'((border-mode-line-active bg-mode-line-active)
          (border-mode-line-inactive bg-mode-line-inactive)
		  (fg-heading-1 blue-cooler)
		  (prose-done fg-dim)
		  (prose-done fg-dim)
		  (fringe unspecified)
		  (bg-line-number-inactive unspecified)
          (bg-line-number-active bg-dim)
          (bg-hl-line bg-dim)
		  (bg-prose-block-delimiter unspecified)
		  (bg-tab-bar bg-main)
		  (bg-tab-current bg-main)
		  (fg-tab-current bg-main)
		  (bg-tab-other bg-main)
		  (fg-tab-other bg-main)
		  (comment fg-dim)))

  (setq modus-themes-fringes nil)
  (setq modus-themes-italic-constructs t)
  (setq modus-themes-bold-constructs t)
  (setq modus-themes-mixed-fonts t)
  (setq modus-themes-custom-auto-reload t)

  (load-theme 'modus-vivendi-tinted))
#+end_src

** Modeline
I am using ~mood-line~ as it is easily customizable and by default only uses ASCII symbols. Most segments of the modeline are only shown on the selected window. The code could be improved a lot but it works as is, so I roll with it. I might add some custom elements in the future for some third-party-packages like ~lsp-mode~.

#+begin_src emacs-lisp
(use-package evil-anzu)

(use-package anzu
  :init
  (global-anzu-mode +1))

(use-package mood-line
	:ensure t
	:config
	(mood-line-mode)
  :custom
	(mood-line-format (mood-line-defformat
										 :left
                     (((when (mode-line-window-selected-p)
                         (mood-line-segment-modal)) . " ")
                      ((when (mode-line-window-selected-p)
                         (propertize "|" 'face 'modus-themes-fg-cyan-faint)) . " ")
											((mood-line-segment-buffer-status) . " ")
											((if (mode-line-window-selected-p)
													 (mood-line-segment-buffer-name)
												 (propertize (mood-line-segment-buffer-name) 'face 'mood-line-unimportant)) . "")
                      ((propertize " (" 'face 'mood-line-unimportant) . "")
                      ((propertize (mood-line-segment-major-mode) 'face 'mood-line-unimportant) . "")
                      ((propertize ")" 'face 'mood-line-unimportant) . "")
                      ((when (mode-line-window-selected-p)
                         (propertize " |" 'face 'modus-themes-fg-cyan-faint)) . " ")
                      ((when (mode-line-window-selected-p)
                         (mood-line-segment-vc)) . " "))
                     :right
                     (((when (mode-line-window-selected-p)
                         (mood-line-segment-checker)) . " ")
											;; ((when (mode-line-window-selected-p)
                      ;;    (mood-line-segment-process)) . " ")
                      ((mood-line-segment-anzu) . " ")
                      ((when (mode-line-window-selected-p)
                         (mood-line-segment-cursor-position)) . " ")
                      ((when (mode-line-window-selected-p)
                         (mood-line-segment-scroll)) . " ")
                      (propertize "[" 'face 'modus-themes-fg-magenta-intense)
											((propertize (mood-line-segment-project) 'face 'modus-themes-fg-magenta-intense) . "")
                      (propertize "]" 'face 'modus-themes-fg-magenta-intense)))))
#+end_src

** Fonts
Defining the fonts I am using. Currently only ~VictorMono as a nerd font~.

#+begin_src emacs-lisp
(set-face-attribute 'default nil
					:font "VictorMono Nerd Font"
					:height 180
					:weight 'normal)
(set-face-attribute 'variable-pitch nil
					:font "VictorMono Nerd Font"
					:height 180
					:weight 'normal)
(set-face-attribute 'fixed-pitch nil
					:font "VictorMono Nerd Font"
					:height 180
					:weight 'normal)
;; Makes commented text and keywords italics.
;; This is working in emacsclient but not emacs.
;; Your font must have an italic face available.
(set-face-attribute 'font-lock-comment-face nil
					:slant 'italic)
(set-face-attribute 'font-lock-keyword-face nil
					:slant 'italic)

;; This sets the default font on all graphical frames created after restarting Emacs.
;; Does the same thing as 'set-face-attribute default' above, but emacsclient fonts
;; are not right unless I also add this method of setting the default font.
(add-to-list 'default-frame-alist '(font . "VictorMono Nerd Font-18"))

;; Uncomment the following line if line spacing needs adjusting.
(setq-default line-spacing 0.12)
#+end_src

** Rainbow Delimiters
To make it easier to spot delimiter issues I am using rainbow-delimiters.

#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Zooming In/Out
You can use the bindings C-+ C-- for zooming in/out. You can also use CTRL plus the mouse wheel for zooming in/out.

#+begin_src emacs-lisp
(use-package emacs
  :ensure nil
  :bind
  ("C-+" . text-scale-increase)
  ("C--" . text-scale-decrease)
  ("<C-wheel-up>" . text-scale-increase)
  ("<C-wheel-down>" . text-scale-decrease))
#+end_src

* Completion
** Completion Style
The ~orderless~ completion style seems to be what everyone is using now. Trying it out currently.

#+begin_src emacs-lisp
(use-package orderless
  :init
  (setq completion-styles '(orderless partial-completion basic)
        completion-category-defaults nil
        completion-category-overrides nil))
#+end_src

** Mini-buffer
- Vertico: Provides a performant and minimalist vertical completion UI based on the default completion system.
- Savehist: Saves completion history.
- Marginalia: Adds extra metadata for completions in the margins (like descriptions).

We use this packages, because they use Emacs native functions. Unlike Ivy or Helm.
One alternative is ivy and counsel, check out the [[https://github.com/MiniApollo/kickstart.emacs/wiki][project wiki]] for more information.

#+begin_src emacs-lisp
(use-package vertico
  :init
  (vertico-mode))

(savehist-mode) ;; Enables save history mode

(use-package marginalia
  :after vertico
  :init
  (marginalia-mode))
#+end_src

** In-Buffer
For in-buffer completion, ~corfu~ is used.

#+begin_src emacs-lisp
(use-package corfu
  :ensure t
  :custom
  (corfu-cycle t)
  (corfu-preselect 'prompt)
  (corfu-on-exact-match nil)
  (corfu-quit-no-match nil)
	(corfu-auto t)
  (corfu-quit-no-match t)
	(corfu-auto-prefix 2)
  (corfu-popupinfo-mode t)
  (corfu-popupinfo-delay 0.5)
  :bind
  (:map corfu-map
        ("TAB" . corfu-next)
        ([tab] . corfu-next)
        ("S-TAB" . corfu-previous)
        ([backtab] . corfu-previous))
  :init
  (global-corfu-mode))

(use-package nerd-icons-corfu
	:ensure t
  :after corfu
  :init (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

(use-package emacs
  :ensure nil
  :custom
  (tab-always-indent 'complete)
  (text-mode-ispell-word-completion nil)
  (read-extended-command-predicate #'command-completion-default-include-p))

(use-package cape
	:ensure t
  :bind ("C-c p" . cape-prefix-map)
	:init
	(add-hook 'completion-at-point-functions #'cape-dabbrev)
	(add-hook 'completion-at-point-functions #'cape-file)
	(add-hook 'completion-at-point-functions #'cape-keyword)
	(add-hook 'completion-at-point-functions #'cape-elisp-symbol)
	(add-hook 'completion-at-point-functions #'cape-elisp-block))
#+end_src

