README.org
** Consult
Provides search and navigation commands based on the Emacs completion function.
Check out their [[https://github.com/minad/consult][git repository]] for more awesome functions.

#+begin_src emacs-lisp
(use-package consult
  ;; Enable automatic preview at point in the *Completions* buffer. This is
  ;; relevant when you use the default completion UI.
  :hook (completion-list-mode . consult-preview-at-point-mode)
  :init
  ;; Optionally configure the register formatting. This improves the register
  ;; preview for `consult-register', `consult-register-load',
  ;; `consult-register-store' and the Emacs built-ins.
  (setq register-preview-delay 0.5
        register-preview-function #'consult-register-format)

  ;; Optionally tweak the register preview window.
  ;; This adds thin lines, sorting and hides the mode line of the window.
  (advice-add #'register-preview :override #'consult-register-window)

  ;; Use Consult to select xref locations with preview
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)
  :config
  ;; Optionally configure preview. The default value
  ;; is 'any, such that any key triggers the preview.
  ;; (setq consult-preview-key 'any)
  ;; (setq consult-preview-key "M-.")
  ;; (setq consult-preview-key '("S-<down>" "S-<up>"))

  ;; For some commands and buffer sources it is useful to configure the
  ;; :preview-key on a per-command basis using the `consult-customize' macro.
  ;; (consult-customize
  ;; consult-theme :preview-key '(:debounce 0.2 any)
  ;; consult-ripgrep consult-git-grep consult-grep
  ;; consult-bookmark consult-recent-file consult-xref
  ;; consult--source-bookmark consult--source-file-register
  ;; consult--source-recent-file consult--source-project-recent-file
  ;; :preview-key "M-."
  ;; :preview-key '(:debounce 0.4 any))

  ;; By default `consult-project-function' uses `project-root' from project.el.
  ;; Optionally configure a different project root function.
   ;;;; 1. project.el (the default)
  ;;(setq consult-project-function #'consult--default-project--function)
   ;;;; 2. vc.el (vc-root-dir)
  ;; (setq consult-project-function (lambda (_) (vc-root-dir)))
   ;;;; 3. locate-dominating-file
  ;; (setq consult-project-function (lambda (_) (locate-dominating-file "." ".git")))
   ;;;; 4. projectile.el (projectile-project-root)
  ;;(autoload 'projectile-project-root "projectile")
  ;;(setq consult-project-function (lambda (_) (projectile-project-root)))
   ;;;; 5. No project support
  ;;(setq consult-project-function nil)
  )
#+end_src

* Git
** Diff in Gutter
Highlights uncommitted changes on the left side of the window (area also known as the "gutter"), allows you to jump between and revert them selectively.

#+begin_src emacs-lisp
(use-package diff-hl
  :ensure t
  :custom
  (diff-hl-draw-borders nil)
  :hook ((dired-mode         . diff-hl-dired-mode-unless-remote)
         (magit-pre-refresh  . diff-hl-magit-pre-refresh)
         (magit-post-refresh . diff-hl-magit-post-refresh))
  :init (global-diff-hl-mode))
#+end_src

** Magit
Currently I use ~lazygit~ at work. Within Emacs nothing beats ~magit~ though. ~forge~ is added for GitHub integration. A succinct guide to setting it up can be found [[https://practical.li/spacemacs/source-control/forge-configuration/][here]]. Note: A ~classic~ token has to be generated for GitHub. It was also necessary to install to do the following on MacOS to set up GPG for to use encrypted ~.authinfo.gpg~:

#+begin_src shell
brew install gpg pinentry-mac
export GPG_TTY=$(tty)
echo "pinentry-program $(which pinentry-mac)" >> ~/.gnupg/gpg-agent.conf
killall gpg-agent
#+end_src

The actual magit/forge config can be found here:

#+begin_src emacs-lisp
(use-package magit
  :custom
  (magit-display-buffer-function 'magit-display-buffer-same-window-except-diff-v1)
  (magit-repository-directories (list (cons elpaca-repos-directory 1)))
  (magit-diff-refine-hunk 'all)
  :config
  (transient-bind-q-to-quit))
(use-package transient :defer t) 
(use-package forge
  :after magit
  :init (setq forge-add-default-bindings nil
              forge-display-in-status-buffer nil
              forge-add-pullreq-refspec nil))
#+end_src

*** TODO Add Magit keybindings
See [[https://gitlab.com/dwt1/configuring-emacs/-/blob/main/07-the-final-touches/config.org?ref_type=heads#backup
][this]].

** GitHub Permalinks
I often visit and copy a link to a specific line for my colleagues. This functionality is provided by ~git-link~.

#+begin_src emacs-lisp
(use-package git-link
  :custom
  (git-link-open-in-browser t))
#+end_src

** Git Timemachine

#+begin_src emacs-lisp
(use-package git-timemachine
	:ensure t
	:hook (evil-normalize-keymaps . git-timemachine-hook)
	:config
	(evil-define-key 'normal git-timemachine-mode-map (kbd "C-j") 'git-timemachine-show-previous-revision)
	(evil-define-key 'normal git-timemachine-mode-map (kbd "C-k") 'git-timemachine-show-next-revision))
#+end_src

** TODO Diff View
~ediff~ or ~smerge~?

* Writing
** Org Mode
*** Base Configuration
My org mode specific configuration.

#+begin_src emacs-lisp
(use-package org
  :ensure nil
  :custom
  (org-directory "~/orgnzr/")
  ;; Fixing source block indentation
  (org-src-tab-acts-natively t)
  (org-edit-src-content-indentation 0)
  (org-edit-src-preserve-indentation nil)
  ;; (org-log-done 'time)
  (org-startup-folded t)
  (org-startup-indented t)
  (org-todo-keywords
   '((sequence "PROJECT(p)" "TODO(t)" "NEXT(n)" "|" "DONE(d)")))
  (org-default-notes-file "~/orgnzr/inbox.org")
  (org-agenda-files '("~/orgnzr"))
  (org-hide-emphasis-markers t)
  (org-pretty-entities t)
  (org-refile-targets
   '((nil :maxlevel . 5)
     (org-agenda-files :maxlevel . 5)))
  (org-capture-templates
   '(("t" "Task" entry (file "~/orgnzr/inbox.org")
      "* TODO %?\n %i\n")
     ("l" "Task  line" entry (file "~/orgnzr/inbox.org")
      "* TODO %?\n Relevant line: [[file://%F::%(with-current-buffer (org-capture-get :original-buffer) (number-to-string (line-number-at-pos)))]]\n")
     ("w" "Work Task" entry (file+olp+datetree "~/orgnzr/work.org")
      "* TODO %?\n")
     ("n" "New note" plain
      (file denote-last-path)
      #'denote-org-capture
      :no-save t
      :immediate-finish nil
      :kill-buffer t
      :jump-to-captured t)))
  (org-agenda-custom-commands
   '(("p" "Personal" 
	    ((agenda "")
	     (todo "NEXT" ((org-agenda-overriding-header "Next Tasks")))
		   (tags "+inbox" ((org-agenda-overriding-header "Uncategorized")))))))
  :hook
  (org-mode . org-indent-mode)
  (org-mode . (lambda() (electric-indent-local-mode -1)))
  (org-mode . (lambda ()
                (setq-local electric-pair-inhibit-predicate
                            `(lambda (c)
                               (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c)))))))
      #+end_src

*** Beautify Org Mode
I am using [[https://github.com/minad/org-modern?tab=readme-ov-file][org-modern]] to make org-mode a bit more pleasant to the eye.

#+begin_src emacs-lisp
(use-package org-modern
  :ensure t
  :custom
  (org-modern-star 'replace)
  :hook 
  (org-mode . org-modern-mode)
  (org-agenda-finalize . org-modern-agenda))
#+end_src

Additionally [[https://codeberg.org/joostkremers/visual-fill-column][Visual-Fill-Column]] is used to center the text.

#+begin_src emacs-lisp
(use-package visual-fill-column
  :ensure t
  :custom
  (visual-fill-column-center-text t)
  (visual-fill-column-enable-sensible-window-split t)
  (visual-fill-column-fringes-outside-margins t)
  :hook
  (org-mode . visual-fill-column-mode))
#+end_src

*** Source Code Block Tag Expansion
Org-tempo is not a separate package but a module within org that can be enabled.
Org-tempo allows for '<s' followed by TAB to expand to a begin_src tag.

#+begin_src emacs-lisp
(use-package org-tempo
  :ensure nil
  :after org)
#+end_src

*** Denote
Currently using ~denote~ as it is way simpler than ~org-roam~.

#+begin_src emacs-lisp
(use-package denote
  :ensure t
  :custom
  (denote-directory (expand-file-name "~/orgnzr/notes/"))
  (denote-save-buffers nil)
  (denote-known-keywords '("dev" "ux" "design" "list" "fleeting" "meeting"))
  (denote-infer-keywords t) 
  (denote-sort-keywords t) 
  (denote-date-prompt-use-org-read-date t)
  (denote-dired-directories
      (list denote-directory
            (thread-last denote-directory (expand-file-name "attachments"))))
  :hook
  (dired-mode . denote-dired-mode)
  :config
  (denote-rename-buffer-mode 1))

(use-package consult-denote
  :ensure t
  :after denote
  :config
  (consult-denote-mode 1))

(use-package denote-menu
  :ensure t
  :after denote
  :general
	(:states 'normal
					 :keymaps 'denote-menu-mode-map
					 "r" 'denote-menu-filter
					 "q" 'kill-current-buffer
					 "o" 'denote-menu-filter-out-keyword
					 "y" 'denote-menu-filter-by-keyword
					 "d" 'denote-menu-export-to-dired
					 "c" 'denote-menu-clear-filters
					 "k" nil))
#+end_src

