README.org
*** Desktop Notifications
This allows for desktop notifications on MacOS.

#+begin_src emacs-lisp
(use-package org-alert
   :ensure t 
   :custom
   (org-alert-notification-title "Orgnzr")
   (org-alert-interval 600)
   (org-alert-notify-cutoff 5)
   (org-alert-notify-after-event-cutoff 10) 
   :config 
   (org-alert-enable))

(use-package alert 
   :ensure t 
   :config (setq alert-default-style 'osx-notifier))
#+end_src

** Spell Checker
The [[https://github.com/minad/jinx][JINX package]] provides a performant option for spell checking (see its README for details). To be able to use it a spell checker and dictionaries have to be installed. I use ~nuspell~ and added the dictionaries on my mac by following the instructions on [[https://github.com/wooorm/dictionaries/tree/main][wooorm/dictionaries]]. To compile ~jinx~ it is also necessary to do: ~brew install enchant pkgconf~.

#+begin_src emacs-lisp
(use-package jinx
  :ensure t)
#+end_src

*** TODO Use Nix to install jinx with dictionaries
* TODO Programming
** TODO LSP (eglot)
** TODO Nix
** TODO Golang
** TODO Terminal/Shell commands
- [ ] Terminal: https://codeberg.org/akib/emacs-eat or libvterm

* Misc
** Diminish
This package implements hiding or abbreviation of the modeline displays (lighters) of minor-modes.
With this package installed, you can add ‘:diminish’ to any use-package block to hide that particular mode in the modeline.

#+begin_src emacs-lisp
(use-package diminish)
#+end_src

* Cleanup
** Elpaca Wait
To make sure that all ~:init~ and ~add-init-hook~'s are working I am using this [[https://github.com/progfolio/elpaca/issues?page=2&q=%3Ainit][workaround]] from the elpaca wiki.

#+begin_src emacs-lisp
(setq elpaca-after-init-time (or elpaca-after-init-time (current-time)))
(elpaca-wait)
#+end_src

** Runtime Performance
Dial the GC threshold back down so that garbage collection happens more frequently but in less time.
We also increase Read Process Output Max so Emacs can read more data.

#+begin_src emacs-lisp
;; Make gc pauses faster by decreasing the threshold.
(setq gc-cons-threshold (* 2 1000 1000))
;; Increase the amount of data which Emacs reads from the process
(setq read-process-output-max (* 1024 1024)) ;; 1mb
#+end_src

